{
  "home": "Home",
  "about": "About",
  "blog": "Blog",
  "archives": "Archives",
  "activity": "Activity",
  "programs": "PROGRAMS",
  "programs_desc": "Explore all our coding programs and classes.",
  "regular_events_classes": "REGULAR EVENTS & CLASSES",
  "regular_events_classes_desc": "Our regular schedule of classes and weekly events.",
  "camps": "CAMPS",
  "camps_desc": "Intensive school holiday and weekend programs.",
  "training": "TRAINING",
  "training_desc": "Specialized training for individuals and corporations.",
  "media": "Media",
  "youtube": "YouTube",
  "youtube_desc": "Our video tutorials and vlogs.",
  "tiktok": "TikTok",
  "tiktok_desc": "Short videos and coding tips.",
  "info": "Info",
  "contact_us": "CONTACT US",
  "contact_us_desc": "Contact us for questions or collaborations.",
  "partners": "PARTNERS",
  "partners_desc": "See our partners and collaborators.",
  "calendar": "CALENDAR",
  "calendar_desc": "View our event and class schedule.",
  "footer_text": "© 2025 Copyright by ProCodeCG. All rights reserved.",
  "hero_title": "Learn Technology, Realize Innovation",
  "hero_subtitle": "Discover exciting stories and coding tips on our blog, let's become future IT heroes",
  "visit_our_blog": "Visit Our Blog",
  "why_procodecg_title": "Why Choose ProCodeCG?",
  "relevant_curriculum": "Relevant Curriculum",
  "relevant_curriculum_desc": "Learning materials always updated according to the latest technological developments.",
  "fun_learning": "Fun Learning",
  "fun_learning_desc": "Interactive teaching methods and practical projects that make learning to code fun.",
  "active_community": "Active Community",
  "active_community_desc": "Join a supportive community to share, collaborate, and grow together.",
  "latest_blog_posts_title": "Latest Insights from Our Blog",
  "read_more": "Read More",
  "read_all_posts": "Read All Posts",
  "latest_videos_title": "Our Latest Videos",
  "view_video": "View Video",
  "fixed_news_schedule_title": "Important News & Schedule",
  "external_articles_title": "Featured Articles from Various Sources",
  "read_article": "Read Article",
  "explore_more_articles": "Explore More Articles",
  "call_to_action_title": "Ready to Start Your Coding Adventure?",
  "call_to_action_subtitle": "Explore our inspiring articles or find the right course for you.",
  "visit_blog": "Visit Blog",
  "view_archives": "View Archives",
  "procodecg_calendar_title": "ProCodeCG Event Calendar",
  "events_on": "Events on",
  "no_events_scheduled": "No events scheduled for this date.",
  "search_video": "Search video...",
  "loading_videos": "Loading videos...",
  "failed_to_load_videos": "Failed to load videos. Please try again later.",
  "no_matching_videos": "No videos matching your search.",
  "previous": "Previous",
  "next": "Next",
  "search_post": "Search post...",
  "tag": "Tag",
  "all_time": "All Time",
  "select_period": "Select Period",
  "no_matching_posts": "No posts matching your filters.",
  "return_to_home": "Return to Home",
  "page_not_found_title": "404",
  "page_not_found_subtitle": "Oops! Page not found",
  "post_not_found_title": "Post Not Found",
  "post_not_found_message": "Sorry, the post you are looking for does not exist.",
  "return_to_post_list": "Return to Post List",
  "our_partners_title": "Our Partners",
  "our_partners_subtitle": "We are proud to collaborate with various organizations and institutions to achieve our mission.",
  "contact_us_title": "Let's Connect!",
  "contact_us_subtitle": "We are always open to questions, collaborations, or just saying hello.",
  "email_us": "Email Us",
  "follow_us_on_facebook": "Follow Us on Facebook",
  "mention_us_on_twitter": "Mention Us on Twitter",
  "visit_our_official_website": "Visit Our Official Website",
  "ready_for_next_step": "Ready for the next step?",
  "explore_more_or_send_message": "Explore more or send us a message.",
  "back_to_home": "Back to Home",
  "about_procodecg_title": "About ProCodeCG",
  "about_procodecg_subtitle": "ProCodeCG is a Bandung-based startup, focusing on technology, especially programming and coding literacy. We are passionate about helping children build and develop their skills in the IT environment, as we realize that children are the most valuable investment for future human resource needs. We help future industries by shaping children's skills early on to meet the requirements of the rapidly changing technology industry landscape worldwide.",
  "our_mission": "Our Mission",
  "our_mission_desc": "Our mission is to empower the younger generation with programming and coding literacy, helping them build essential IT skills to face challenges and opportunities in the ever-evolving technology industry.",
  "our_vision": "Our Vision",
  "our_vision_desc": "We also strive to support the creative industry by building a 'Code Meet Up' community, where creative individuals with diverse knowledge can gather, share, collaborate, and create innovations together.",
  "our_values": "Our Values",
  "accessibility": "Accessibility",
  "accessibility_desc": "We believe quality education should be accessible to everyone, regardless of background or location.",
  "innovation": "Innovation",
  "innovation_desc": "We continuously innovate in teaching methods and content to ensure you always get the latest information.",
  "community": "Community",
  "community_desc": "We build a supportive community where learners can interact, share, and grow together.",
  "our_team": "Our Team",
  "ready_to_start_learning_journey": "Ready to Start Your Learning Journey?",
  "explore_latest_insights_from_blog": "Explore the latest insights from our blog.",
  "camps_program_title": "Camps Program",
  "camps_program_subtitle": "Explore our intensive coding camp programs designed for various skill levels.",
  "details_coming_soon": "Details for {{campTitle}} - {{dayLabel}} will be available soon!",
  "training_program_title": "Training Program",
  "training_program_subtitle": "Explore our specialized training programs designed to enhance your skills in various technology fields.",
  "schedule_events_title": "ProCodeCG Schedule & Events",
  "schedule_events_subtitle": "Discover our learning topics, regular classes, and community events.",
  "select_activity": "Select Activity",
  "all_activities": "All Activities",
  "running_classes": "Running Classes",
  "regular_events": "Regular Events",
  "running_classes_section_title": "Running Classes",
  "regular_events_section_title": "Regular Events",
  "programs_page_title": "Our Programs",
  "programs_page_subtitle": "Explore various coding and training programs we offer, designed for all levels and needs.",
  "select_program_type": "Select Program Type",
  "all_programs": "All Programs",
  "kids_classes": "Kids Classes",
  "private_tutoring": "Private & Tutoring Classes",
  "professional_training": "Professional Training",
  "schedule": "Schedule",
  "registration_fee": "Registration Fee",
  "price": "Price",
  "price_details": "Price Details",
  "no_programs_available": "No programs available. Please add new programs.",
  "youtube_page_title": "Our YouTube Videos",
  "youtube_page_subtitle": "Explore the latest tutorials, vlogs, and educational content from our YouTube channel.",
  "tiktok_page_title": "Our TikTok Video Collection",
  "tiktok_page_subtitle": "Discover short videos, coding tips, and behind-the-scenes fun from our TikTok profile.",
  "featured_courses_title": "Most Popular Courses",
  "view_details": "View Details",
  "view_all_courses": "View All Courses",
  "events": {
    "new_year": "New Year",
    "html_workshop": "HTML Basics Workshop",
    "javascript_class_starts": "JavaScript Class Starts",
    "react_webinar": "React.js Webinar",
    "codemeetup": "ProCodeCG codeMeetUp()",
    "python_training": "Python Data Science Training",
    "summer_camp_registration": "Summer Camp Registration Opens",
    "debugging_session": "Advanced Debugging Session",
    "national_education_day": "National Education Day",
    "final_project_presentation": "Final Project Presentation",
    "national_holiday": "National Holiday",
    "uiux_workshop": "UI/UX Workshop",
    "kids_coding_class": "Kids Regular Coding Class",
    "ai_intro_workshop": "Free Workshop: Intro to AI",
    "new_class_starts": "New Class Starts",
    "independence_day": "Independence Day",
    "cybersecurity_seminar": "Cybersecurity Seminar",
    "holiday_camp_registration": "Holiday Camp Registration",
    "christmas_holiday": "Christmas Holiday"
  },
  "blog_posts": {
    "post1_title": "Let's Make Your First Fun Blog",
    "post1_excerpt": "An exciting guide for those who want to have their own blog, it's super easy",
    "post1_content": "<p>Making a blog is like having your own storybook on the internet. You can share anything you like, for example, your adventure stories, funny pictures, or game tips. This is a place where your voice can be heard by many people around the world. The most important first step is to think about what you like most and what you want to tell. Is it about your new hobby, a review of your favorite game, or maybe an exciting adventure during the holidays?</p><p>Once you have an idea, it's time to choose a 'home' for your blog. There are many platform options you can use, from simple and easy-to-use for beginners, to more advanced ones like building it yourself with adult help, as we do here with React. Most importantly, make sure the place you choose is safe, easily accessible, and fun for you to explore.</p><p>Finally, and this is the most fun part, start writing. Don't be afraid if your first writing isn't perfect or you feel a little awkward. Every great writer definitely starts from scratch. The more you write, the more you will find your own writing style, and your writing will become cooler and more interesting. Remember, blogging is a journey, not a destination. Happy blogging, champion!</p>",
    "post1_category": "HTML Basics",
    "post1_author": "Instructor A",
    "post1_tags": ["beginner", "blogging", "writing"],
    "post2_title": "Secrets to Writing Blog Stories That Make You Stay",
    "post2_excerpt": "Want your writing to be read by many friends? Here are the tips!",
    "post2_content": "<p>Want your writing to be read by many friends and make them stay on your blog for a long time? Here are some secrets you can try. First, start with a captivating title. The title is like the entrance to your story, so it must grab attention. Try using questions, numbers, or words that spark curiosity, such as 'The Adventure of the Magical Cat That Changed the World' or '5 Easy Ways to Make a Robot from Used Cardboard'.</p><p>Second, use short and easy-to-understand sentences. Avoid paragraphs that are too long because they can make readers quickly bored. You can also use bullet points or subheadings to break up the text and make it easier to digest. This will help readers follow your story without feeling overwhelmed.</p><p>Third, don't forget to add funny pictures, interesting illustrations, or exciting videos relevant to your story. Visuals will make your blog more lively and not boring. Finally, at the end of the writing, invite your friends to comment or share their own stories. For example, 'What exciting adventures have you experienced?' or 'Do you have other tips for writing a blog?' This will make them feel engaged and want to come back to your blog to interact.</p>",
    "post2_category": "CSS Styling",
    "post2_author": "Instructor B",
    "post2_tags": ["content", "writing", "tips"],
    "post3_title": "Make Your Blog Easy to Find on the Internet",
    "post3_excerpt": "Learn how to make your blog appear at the top when friends search for it.",
    "post3_content": "<p>Have you ever searched for something on Google and found many results? Well, to make your blog easy for friends to find too, we need a little 'magic' called SEO (Search Engine Optimization). SEO is like a secret direction that helps search engines like Google find and display your blog at the top of search results.</p><p>The trick is to use important words or 'keywords' that people often search for in your blog's title and content. For example, if your blog is about 'toy robots', make sure the words 'toy robots' are in the title, in the first paragraph, and several times throughout your writing. But remember, don't use too many, or it will look strange and unnatural. Use keywords wisely so your writing remains enjoyable to read.</p><p>In addition, make sure your blog loads quickly and looks good on mobile phones or tablets. Many people access the internet from mobile devices, so a responsive blog is very important. The better your blog is in terms of speed and appearance on various devices, the more often search engines will recommend it to friends who are looking for information about the topic you are writing about. That way, your blog can become famous and reach more readers.</p>",
    "post3_category": "Interactive JavaScript",
    "post3_author": "Instructor C",
    "post3_tags": ["SEO", "internet", "visibility"],
    "post4_title": "JavaScript Magic Makes Websites Alive",
    "post4_excerpt": "Get to know JavaScript, the secret language that makes websites move and interactive.",
    "post4_content": "<p>Have you ever seen a button on a website that changes color when touched? Or an image that moves when you click it? All of that is the magic of JavaScript. JavaScript is a programming language that makes our websites more interactive, dynamic, and fun. Without JavaScript, websites would feel stiff, like a picture book that can't move.</p><p>Imagine a website as a house. HTML is the frame of the house, which determines where the walls, doors, and windows are. CSS is the paint and decorations, which make the house look beautiful with attractive colors and styles. Well, JavaScript is like the electricity and all the tools that make the house function, such as lights that can turn on, doors that can open automatically, or even a self-cleaning robot that moves on its own.</p><p>With JavaScript, we can create simple games directly in the browser, functional calculators, interactive forms, or even funny animations that make visitors stay longer. Learning JavaScript is like learning a new spell that can make our websites more lively, responsive, and enjoyable to use. This is an important step to becoming a reliable web 'wizard'.</p>",
    "post4_category": "Interactive JavaScript",
    "post4_author": "Instructor A",
    "post4_tags": ["JavaScript", "web", "interactive"],
    "post5_title": "Let's Make Cool Apps with React",
    "post5_excerpt": "Learn to build sophisticated and interactive web applications with React, it's really fun!",
    "post5_content": "<p>React is like a giant LEGO box for creating applications on the internet. Instead of building everything from scratch, we can use small 'blocks' that are already made (called components) and combine them into a large and sophisticated application. Each of these blocks has its own task, for example, one block for a button, one block for a list, and one block for an image.</p><p>For example, you want to create a shopping list application. With React, you can create one block for 'shopping items' that you can check, one block for an 'add button' for new items, and another block for the 'shopping list' as a whole. Then, you just arrange these blocks into a complete and functional application. The advantage of using these blocks is that you can use them repeatedly in different places without having to rewrite the code.</p><p>React is very popular among developers because it makes the application development process faster, easier, and more organized. Many large applications you use every day, such as Facebook, Instagram, or Netflix, are also built with React, you know. So, if you learn React, you can have the ability to create cool applications like them and become part of the ever-evolving world of technology.</p>",
    "post5_category": "Final Project",
    "post5_author": "Instructor B",
    "post5_tags": ["React", "web application", "programming"],
    "post6_title": "Python the Smart Data Processor",
    "post6_excerpt": "Start your adventure in the world of data with Python, a programming language that's good at calculations.",
    "post6_content": "<p>Python is a very smart programming language, especially when it comes to data. Data is like a collection of information, for example, a list of your friends' names, test scores at school, how many ice creams were sold in the canteen, or even weather data. Python has an extraordinary ability to process, analyze, and understand this data.</p><p>With Python, we can ask the computer to calculate average scores, sort a list of names from A to Z, or even find interesting patterns from ice cream sales data. For example, you can find out what ice cream flavor is most popular on Fridays, or which month has the highest ice cream sales. This is very useful for making better decisions based on existing information.</p><p>In addition to processing data, Python is also used to create games, web applications, and even help smart robots or artificial intelligence. Learning Python is like having a super smart friend who is ready to help you understand the world of numbers and information in a fun and easy way. This is a very valuable skill in today's digital era.</p>",
    "post6_category": "HTML Basics",
    "post6_author": "Instructor C",
    "post6_tags": ["Python", "data science", "programming"],
    "post7_title": "Tailwind CSS Makes Website Display More Beautiful",
    "post7_excerpt": "The secret to making your website super cool and neat without hassle.",
    "post7_content": "<p>Have you ever wanted to make your website look super cool, neat, and modern without having to bother with a lot of design code? Well, there's a magic tool called Tailwind CSS. Tailwind is like a complete set of colored pencils and rulers for designing websites, but in a very efficient code form.</p><p>Usually, we have to write many lines of CSS code to set the color, size, position, or font type of each part of the website. But with Tailwind, we just use short 'names' that already exist (called utility classes) directly in our HTML code. For example, to make blue text with a large size, you just add classes like 'text-blue-500 text-xl font-bold'. This is very intuitive and fast.</p><p>This approach makes the design process faster and easier, like arranging design blocks. You can quickly change the appearance of elements without having to switch between CSS and HTML files. So, you can focus on your creative ideas and create a website that looks stunning and is responsive on various screen sizes, without having to bother with a lot of complex design code. Tailwind CSS is the right choice to make your website look professional and grab attention.</p>",
    "post7_category": "CSS Styling",
    "post7_author": "Instructor A",
    "post7_tags": ["Tailwind CSS", "web design", "styling"],
    "post8_title": "JavaScript Patiently Waits Before Running",
    "post8_excerpt": "Ever seen a website loading? That's JavaScript patiently waiting.",
    "post8_content": "<p>Have you ever opened a website and seen a part that is still loading or waiting for something before it fully appears? That's because JavaScript is patiently working behind the scenes. This concept is called 'asynchronous' or 'async/await', and it is one of the most powerful features of JavaScript that makes websites feel fast and responsive.</p><p>Imagine you are ordering food at a restaurant. You wouldn't just sit there waiting for your food to be ready, would you? You can drink, chat with friends, or look at other menus. Well, JavaScript is like that too. It can do other work (for example, displaying other parts of the website) while waiting for data from the internet (such as images or information from the server) or waiting for a time-consuming task to complete.</p><p>So, your website won't 'freeze' or stop completely just because it's waiting for one thing. JavaScript will finish other tasks first, and when the awaited task is ready, it will continue its work. This makes the user experience smoother, as the website remains interactive even if there are processes running in the background. Understanding asynchronous JavaScript is key to building modern and efficient web applications.</p>",
    "post8_category": "Interactive JavaScript",
    "post8_author": "Instructor B",
    "post8_tags": ["JavaScript", "asynchronous", "web performance"],
    "post9_title": "Become a Code Detective: Find and Fix Errors",
    "post9_excerpt": "Learn to be a reliable detective who can find and fix 'bugs' in your program.",
    "post9_content": "<p>When we write code, sometimes there are small errors that make our programs not run as desired. These errors are often called 'bugs', like small insects that disrupt the system. Well, our job as programmers is to be code detectives to find and fix these bugs. This process of finding and fixing bugs is called 'debugging', and it is one of the most important skills a developer must have.</p><p>Debugging is like playing a challenging puzzle. We have to look at our code carefully, read error messages (if any), and try to understand where the error is. Sometimes, bugs can be very hidden and require extra patience to find them. We can use various techniques, such as adding 'console.log' to display variable values at certain points, or using advanced debugger tools to trace the code execution flow step by step.</p><p>Although sometimes frustrating, the debugging process is actually very educational. Every time you successfully find and fix a bug, you will learn more about how code works and how to write better code in the future. This will make you a smarter, more thorough programmer, and able to create programs that work perfectly. So, prepare your magnifying glass and let's hunt for bugs!</p>",
    "post9_category": "Final Project",
    "post9_author": "Instructor C",
    "post9_tags": ["debugging", "programming", "error handling"]
  },
  "archive_posts": {
    "archive1_title": "HTML & CSS Final Project Gallery Class of 2023",
    "archive1_excerpt": "See the amazing works of our students in building their first websites.",
    "archive1_category": "Student Projects",
    "archive1_author": "Teaching Team",
    "archive1_tags": ["project", "HTML", "CSS", "gallery"],
    "archive2_title": "Exciting Moments Learning Interactive JavaScript",
    "archive2_excerpt": "A compilation of photos and stories from JavaScript practical sessions full of laughter and discoveries.",
    "archive2_category": "Class Activities",
    "archive2_author": "Instructor B",
    "archive2_tags": ["JavaScript", "interactive", "learning", "moments"],
    "archive3_title": "Best React Web Application Exhibition",
    "archive3_excerpt": "Witness our students' innovations in creating dynamic web applications using React.",
    "archive3_category": "Student Projects",
    "archive3_author": "Teaching Team",
    "archive3_tags": ["React", "application", "innovation", "exhibition"],
    "archive4_title": "Reflection on Learning Python for Data Science",
    "archive4_excerpt": "Stories and experiences of students processing data using Python.",
    "archive4_category": "Learning Reflection",
    "archive4_author": "Instructor A",
    "archive4_tags": ["Python", "data science", "reflection", "experience"],
    "archive5_title": "UI/UX Design Workshop with Tailwind CSS",
    "archive5_excerpt": "Documentation of a practical workshop on designing responsive user interfaces.",
    "archive5_category": "Workshop",
    "archive5_author": "Instructor B",
    "archive5_tags": ["Tailwind CSS", "UI/UX", "design", "workshop"],
    "archive6_title": "Code Debugging Problem Solving Session",
    "archive6_excerpt": "Snippets from interactive sessions where students learn to be code detectives.",
    "archive6_category": "Class Activities",
    "archive6_author": "Instructor C",
    "archive6_tags": ["debugging", "problem solving", "code", "practice"],
    "archive7_title": "Industry Visit: Getting to Know the Startup World",
    "archive7_excerpt": "Report on student visits to leading tech startups in Bandung.",
    "archive7_category": "External Activities",
    "archive7_author": "Teaching Team",
    "archive7_tags": ["visit", "industry", "startup", "experience"],
    "archive8_title": "Mini Hackathon: Fun Coding Challenge",
    "archive8_excerpt": "Summary of a mini hackathon that tested students' coding and collaboration skills.",
    "archive8_category": "Competition",
    "archive8_author": "Instructor B",
    "archive8_tags": ["hackathon", "coding", "challenge", "collaboration"],
    "archive9_title": "Latest Batch Graduation Certification",
    "archive9_excerpt": "Graduation celebration and certificate presentation for students who have completed the course.",
    "archive9_category": "Special Event",
    "archive9_author": "Management",
    "archive9_tags": ["graduation", "certification", "celebration", "achievement"]
  },
  "team_members": {
    "marisa_name": "Marisa Paryasto",
    "marisa_role": "Founder & CEO",
    "marisa_desc": "PhD Electrical Engineering Institute Technology Bandung. A researcher at ITB and a part-time lecturer at Telkom University. Experienced in teaching and education, expert in computer engineering/science, programming, and cryptography. Greatly admires children.",
    "budi_name": "Budi Rahardjo",
    "budi_role": "Mentor",
    "budi_desc": "PhD, Faculty of Electrical Engineering Bandung Institute of Technology. Contributes to guiding and directing the development of our programs.",
    "prayudi_name": "Prayudi Utomo",
    "prayudi_role": "CodeinTech Founder & Programmer",
    "prayudi_desc": "Founder of CodeinTech and an experienced programmer passionate about technological innovation.",
    "faris_name": "Faris Hafizhan Hakim",
    "faris_role": "Teaching Assistant",
    "faris_desc": "One of our dedicated captains and teaching assistants for children's classes.",
    "bullitt_name": "Bullitt Zulfiqar",
    "bullitt_role": "Teaching Assistant",
    "bullitt_desc": "An enthusiastic captain and teaching assistant, helping children develop their IT skills."
  },
  "partners_data": {
    "dycode_name": "DyCode",
    "dycode_desc": "A leading technology company focused on software development and digital solutions.",
    "codeintech_name": "CodeinTech",
    "codeintech_desc": "An active developer community that shares knowledge and holds coding workshops.",
    "telkom_university_name": "Telkom University",
    "telkom_university_desc": "A higher education institution that collaborates in training programs and curriculum development.",
    "itb_name": "ITB (Bandung Institute of Technology)",
    "itb_desc": "One of the best engineering universities in Indonesia, a partner in research and development.",
    "startup_bandung_name": "Startup Bandung",
    "startup_bandung_desc": "A network of local startups that support innovation and the technology ecosystem in Bandung."
  },
  "camps_data": {
    "camp1_title": "Kids Half-Day Coding Camp",
    "camp1_desc": "Half-day coding camp for children.",
    "camp2_title": "Kids Half-Day Coding Camp for Beginner",
    "camp2_desc": "Introduction to Games and Making Games with Blockly and Game Maker.",
    "camp3_title": "Kids Half-Day Coding Camp for Intermediate",
    "camp3_desc": "Coding with JavaScript and Python.",
    "camp4_title": "Kids Half-Day Coding Camp for Advanced",
    "camp4_desc": "Minecraft Modding with ScriptCraft and CanaryMod.",
    "camp5_title": "Kids Half-Day Coding Camp – Games Development",
    "camp5_desc": "Blockly, GameMaker, JavaScript, Python, Minecraft Modding.",
    "camp6_title": "Kids Half-Day Coding Camp – Cryptography",
    "camp6_desc": "Introduction to Python, Caesar Cipher, Vigenere Cipher.",
    "camp7_title": "Kids Half-Day Coding Camp – Virus Antivirus",
    "camp7_desc": "Introduction to Python, Simple Virus and Antivirus, Encryption Virus and AntiVirus."
  },
  "training_data": {
    "training1_title": "Training on Games Development",
    "training1_desc": "Intensive training to develop interactive games using the latest technology.",
    "training2_title": "Intensive Training on Apps Development",
    "training2_desc": "In-depth training program to build responsive and functional cross-platform applications.",
    "training3_title": "iOS App Development Training with DyCode",
    "training3_desc": "Specialized iOS application development training in collaboration with DyCode, focusing on Swift and Xcode."
  },
  "regular_events_classes_data": {
    "topic1_title": "Algorithm & Data Structure",
    "topic1_desc": "Learn the basics of programming, the mindset structure of programmers with an introduction to Procedural Programming vs Object-Oriented Programming, Design Patterns, etc.",
    "topic2_title": "Game Programming",
    "topic2_desc": "Learn how to develop games using simple programming languages.",
    "topic3_title": "Web Programming",
    "topic3_desc": "Learn how to develop web for various purposes.",
    "topic4_title": "Application Programming",
    "topic4_desc": "Learn how to design and develop applications on various platforms (iOS, Android, Blackberry, Windows).",
    "topic5_title": "Crypto Programming",
    "topic5_desc": "Learn how to code for cryptography, to secure applications, software, and computers.",
    "topic6_title": "Basic Hardware Programming",
    "topic6_desc": "Learn how to program hardware using Assembly or C/C++.",
    "class1_name": "Programming for Kids",
    "class1_schedule": "Every Saturday, 09.00 – 11.00 WIB",
    "class1_desc": "A class specially designed to introduce the basics of programming to children in a fun and interactive way.",
    "event1_name": "ProCodeCG codeMeetUp()",
    "event1_schedule": "Every Monday, 13.00 – 15.00 WIB",
    "event1_desc": "A regular meeting event for developers and coding enthusiasts to share knowledge, collaborate, and discuss the latest technology trends."
  },
  "programs_data": {
    "kids_regular_coding_class_title": "Kids Regular Coding Class",
    "kids_regular_coding_class_desc": "ProCodeCG Kids Programming Class is a regular event every Saturday 9 - 12.",
    "kids_regular_coding_class_schedule": "Every Saturday, 09.00 – 12.00 WIB",
    "kids_regular_coding_class_price_header1_col1": "Number of Participants",
    "kids_regular_coding_class_price_header1_col2": "Price (1 Session - 90 minutes)",
    "kids_regular_coding_class_price_row1_col1": "Two participants",
    "kids_regular_coding_class_price_row2_col1": "Three participants",
    "kids_regular_coding_class_price_row3_col1": "Four participants",
    "kids_regular_coding_class_price_row4_col1": "Five or more participants",
    "kids_regular_coding_class_price_header2_col1": "Number of Participants",
    "kids_regular_coding_class_price_header2_col2": "Price (2 Sessions - 180 minutes)",
    "kids_weekday_coding_class_title": "Kids Weekday Coding Class",
    "kids_weekday_coding_class_desc": "ProCodeCG Kids Programming Class is held every Tuesday 16:00 - 17:30, Wednesday 16:30 - 18:00, Thursday & Friday 16:00 - 17:30.",
    "kids_weekday_coding_class_schedule": "Every Tuesday 16:00-17:30, Wednesday 16:30-18:00, Thursday & Friday 16:00-17:30 WIB",
    "kids_weekday_coding_class_price_header1_col1": "Number of Participants",
    "kids_weekday_coding_class_price_header1_col2": "Price per Session",
    "kids_weekday_coding_class_price_row1_col1": "Two participants",
    "kids_weekday_coding_class_price_row2_col1": "Three participants",
    "kids_weekday_coding_class_price_row3_col1": "Four participants",
    "kids_weekday_coding_class_price_row4_col1": "Five or more participants",
    "kids_coding_camp_title": "Kids Coding Camp",
    "kids_coding_camp_desc": "ProCodeCG usually holds Kids Coding Camp event twice a year during school holiday. Each topic takes 3 - 5 days.",
    "online_private_class_title": "Online Private Class",
    "online_private_class_desc": "ProCodeCG provides private classes with customized curriculum and more flexible schedules.",
    "tutoring_coding_class_title": "Tutoring Coding Class",
    "tutoring_coding_class_desc": "ProCodeCG provides online tutoring class for high school and college students to help with their assignments, exams, competitions, etc. Each tutoring session is 90 minutes.",
    "tutoring_coding_class_schedule": "90-minute session",
    "tutoring_coding_class_price_header1_col1": "Number of Participants",
    "tutoring_coding_class_price_header1_col2": "Price per Session",
    "tutoring_coding_class_price_row1_col1": "Two participants",
    "tutoring_coding_class_price_row2_col1": "Three participants",
    "tutoring_coding_class_price_row3_col1": "Four participants",
    "tutoring_coding_class_price_row4_col1": "Five participants",
    "tutoring_coding_class_price_row5_col1": "Six participants",
    "crash_course_customized_training_title": "Crash Course & Customized Training",
    "crash_course_customized_training_desc": "ProCodeCG provides customized curriculum and training. This program is usually for companies or adults.",
    "coding_mom_title": "Coding Mom",
    "coding_mom_desc": "Training Moms to be front-end developers. The topics included are GitHub, HTML, CSS, JavaScript, Bootstrap, PHP, MySQL.",
    "topics_included": "Topics Included"
  },
  "tiktok_videos": {
    "tk1_title": "Fast Coding Tips ala ProCodeCG",
    "tk1_desc": "Learn coding tricks that will speed up your workflow.",
    "tk2_title": "Fun Coding Challenge This Week!",
    "tk2_desc": "Join our coding challenge and win exciting prizes.",
    "tk3_title": "Behind The Scenes Kids Coding Class",
    "tk3_desc": "Peek into the fun behind the scenes of children's coding classes.",
    "tk4_title": "Short Tutorial on Semantic HTML",
    "tk4_desc": "Understand the importance of semantic HTML for better web structure.",
    "tk5_title": "CSS Grid vs Flexbox: When to Use Which?",
    "tk5_desc": "A brief comparison between CSS Grid and Flexbox for responsive layouts.",
    "tk6_title": "JavaScript Array Methods You Must Know",
    "tk6_desc": "Some JavaScript array methods that will simplify your coding.",
    "tk7_title": "React Hooks useState and useEffect",
    "tk7_desc": "Basic introduction to React Hooks useState and useEffect for beginners.",
    "tk8_title": "Python for Daily Task Automation",
    "tk8_desc": "How to use Python to automate repetitive tasks.",
    "tk9_title": "Learn Git and GitHub in 60 Seconds",
    "tk9_desc": "A quick introduction to Git and GitHub for code collaboration."
  },
  "youtube_videos": {
    "yt1_title": "Coding Tutorial for Beginners: Basic HTML",
    "yt1_desc": "Learn the basics of HTML to create your first website structure.",
    "yt2_title": "Getting to Know CSS: Making Websites Beautiful",
    "yt2_desc": "How to make your website look attractive with CSS.",
    "yt3_title": "Interactive JavaScript: Making Websites Alive",
    "yt3_desc": "Add interactivity to your website with JavaScript.",
    "yt4_title": "React JS for Beginners: Building Your First Component",
    "yt4_desc": "First steps to building modern web applications with React JS.",
    "yt5_title": "Python Basics: Variables and Data Types",
    "yt5_desc": "Introduction to Python for beginners, understanding variables and data types.",
    "yt6_title": "Building Responsive Websites with Tailwind CSS",
    "yt6_desc": "Learn how to design websites that look good on all devices.",
    "yt7_title": "Introduction to Algorithms and Data Structures",
    "yt7_desc": "Understand the basic concepts of algorithms and data structures in programming.",
    "yt8_title": "Tips and Tricks for Debugging JavaScript Code",
    "yt8_desc": "Effective ways to find and fix errors in your JavaScript code.",
    "yt9_title": "Creating Simple Animations with CSS",
    "yt9_desc": "Add attractive animation effects to your website using CSS."
  },
  "fixed_items": {
    "f1_title": "New Batch Coding Class Registration Open!",
    "f1_desc": "Don't miss the chance to join our coding class. Register now!",
    "f2_title": "ProCodeCG Receives Education Innovation Award",
    "f2_desc": "We are proud to announce ProCodeCG is recognized for its contribution to technology education innovation.",
    "f3_title": "Free Workshop: Intro to AI for Kids",
    "f3_desc": "Join our interactive workshop to learn the basics of Artificial Intelligence.",
    "f4_title": "New Collaboration with Local Tech Startup",
    "f4_desc": "ProCodeCG establishes strategic partnerships to expand the reach of our programs."
  },
  "external_articles": {
    "ea1_title": "Tech Trends 2024: AI and Machine Learning Dominate",
    "ea1_source": "TechDaily",
    "ea1_desc": "In-depth analysis of how artificial intelligence and machine learning will shape the future of technology.",
    "ea2_title": "The Future of Coding Education for Children",
    "ea2_source": "EduTech Insights",
    "ea2_desc": "Discussion on the importance of digital literacy and coding from an early age.",
    "ea3_title": "Complete Guide to Starting a Career in Data Science",
    "ea3_source": "DataPro Blog",
    "ea3_desc": "Practical steps for beginners who want to pursue a career as a data scientist.",
    "ea4_title": "Cybersecurity: Latest Threats and How to Protect Yourself",
    "ea4_source": "CyberGuard News",
    "ea4_desc": "Updates on the latest cyber threats and tips to maintain your online security."
  },
  "featured_courses": {
    "c1_title": "Learn HTML & CSS from Scratch",
    "c1_desc": "Master the basics of web development with HTML and CSS.",
    "c2_title": "Introduction to Modern JavaScript",
    "c2_desc": "Learn ES6+ JavaScript for web interactivity.",
    "c3_title": "React.js for Beginners",
    "c3_desc": "Build dynamic web applications with React.js.",
    "c4_title": "Python Basics for Data Science",
    "c4_desc": "Start your journey in Data Science with Python."
  }
}